Autodesk.Revit.DB.LeaderAtachement
Since:
2016
Supported types of vertical attachments of a leader to a text note.
Since:
2016

Autodesk.Revit.DB.LeaderAtachement.BottomLine
Leaders are attached at the position of the bottom (last) line of the text box,
and, unless the text's border is visible, the leader's shoulder line extends
all the way to the text, minus the current  value of text border offset.

Autodesk.Revit.DB.LeaderAtachement.Midpoint
Leaders are aligned vertically with the midpoint of the text box and their shoulder line
always ends at the box' border regardless of whether the border is visible on not.

Autodesk.Revit.DB.LeaderAtachement.TopLine
Leaders are attached at the position of the top (first) line of the text box,
and, unless the text's border is visible, the leader's shoulder line extends
all the way to the text, minus the current  value of text border offset.